; domain
(define (domain alfred-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :conditional-effects :existential-preconditions :constraints :action-costs)
 (:types
    receptacletype objecttype checkable - object
    agent location receptacle obj - checkable
 )
 (:constants
   fridgetype microwavetype sinkbasintype - receptacletype
   knifetype butterknifetype - objecttype
 )
 (:predicates (atlocation ?a - agent ?l - location) (receptacleatlocation ?r - receptacle ?l - location) (objectatlocation ?o - obj ?l - location) (openable ?r - receptacle) (opened ?r - receptacle) (inreceptacle ?o - obj ?r - receptacle) (isreceptacleobject ?o - obj) (inreceptacleobject ?innerobject - obj ?outobject - obj) (isreceptacleobjectfull ?o - obj) (wasinreceptacle ?o - obj ?r - receptacle) (checked ?c - checkable) (examined ?l - location) (receptacletype_0 ?r - receptacle ?rt - receptacletype) (cancontain ?rt - receptacletype ?ot - objecttype) (objecttype_0 ?o - obj ?t - objecttype) (holds ?a - agent ?o - obj) (holdsany ?a - agent) (holdsanyreceptacleobject ?a - agent) (full ?r - receptacle) (isclean ?o - obj) (cleanable ?o - obj) (ishot ?o - obj) (heatable ?o - obj) (iscool ?o - obj) (coolable ?o - obj) (pickupable ?o - obj) (moveable ?o - obj) (toggleable ?o - obj) (ison ?o - obj) (istoggled ?o - obj) (sliceable ?o - obj) (issliced ?o - obj))
 (:functions (total-cost))
 (:action look
  :parameters ( ?a - agent ?l - location)
  :precondition (and (atlocation ?a ?l))
  :effect (and (checked ?l) (increase (total-cost) 1)))
 (:action inventory
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
 (:action examinereceptacle
  :parameters ( ?a - agent ?r - receptacle)
  :precondition (and (exists (?l_0 - location)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r ?l_0))))
  :effect (and (checked ?r) (increase (total-cost) 1)))
 (:action examineobject
  :parameters ( ?a - agent ?o - obj)
  :precondition (and (or (exists (?l_0 - location)
 (exists (?r_0 - receptacle)
 (and (atlocation ?a ?l_0) (receptacleatlocation ?r_0 ?l_0) (inreceptacle ?o ?r_0) (or (not (openable ?r_0)) (opened ?r_0))))) (holds ?a ?o)))
  :effect (and (checked ?o) (increase (total-cost) 1)))
 (:action gotolocation
  :parameters ( ?a - agent ?lstart - location ?lend - location)
  :precondition (and (atlocation ?a ?lstart))
  :effect (and (not (atlocation ?a ?lstart)) (atlocation ?a ?lend) (increase (total-cost) 1)))
 (:action openobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (not (opened ?r)))
  :effect (and (opened ?r) (checked ?r) (increase (total-cost) 1)))
 (:action closeobject
  :parameters ( ?a - agent ?l - location ?r - receptacle)
  :precondition (and (openable ?r) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (opened ?r))
  :effect (and (not (opened ?r)) (increase (total-cost) 1)))
 (:action pickupobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (pickupable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r) (not (holdsany ?a)) (or (not (openable ?r)) (opened ?r)))
  :effect (and (not (inreceptacle ?o ?r)) (holds ?a ?o) (holdsany ?a) (not (objectatlocation ?o ?l)) (increase (total-cost) 1)))
 (:action putobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle ?ot - objecttype ?rt - receptacletype)
  :precondition (and (holds ?a ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (or (not (openable ?r)) (opened ?r)) (objecttype_0 ?o ?ot) (receptacletype_0 ?r ?rt) (cancontain ?rt ?ot))
  :effect (and (inreceptacle ?o ?r) (objectatlocation ?o ?l) (not (holds ?a ?o)) (not (holdsany ?a)) (increase (total-cost) 1)))
 (:action cleanobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (cleanable ?o) (receptacletype_0 ?r sinkbasintype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (isclean ?o) (increase (total-cost) 1)))
 (:action heatobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (heatable ?o) (receptacletype_0 ?r microwavetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (ishot ?o) (not (iscool ?o)) (increase (total-cost) 1)))
 (:action coolobject
  :parameters ( ?a - agent ?l - location ?r - receptacle ?o - obj)
  :precondition (and (coolable ?o) (receptacletype_0 ?r fridgetype) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (holds ?a ?o))
  :effect (and (iscool ?o) (not (ishot ?o)) (increase (total-cost) 1)))
 (:action toggleobject
  :parameters ( ?a - agent ?l - location ?o - obj ?r - receptacle)
  :precondition (and (toggleable ?o) (atlocation ?a ?l) (receptacleatlocation ?r ?l) (inreceptacle ?o ?r))
  :effect (and (when (ison ?o) (not (ison ?o))) (when (not (ison ?o)) (ison ?o)) (istoggled ?o) (increase (total-cost) 1)))
 (:action sliceobject
  :parameters ( ?a - agent ?l - location ?co - obj ?ko - obj)
  :precondition (and (sliceable ?co) (or (objecttype_0 ?ko knifetype) (objecttype_0 ?ko butterknifetype)) (atlocation ?a ?l) (objectatlocation ?co ?l) (holds ?a ?ko))
  :effect (and (issliced ?co) (increase (total-cost) 1)))
 (:action help
  :parameters ( ?a - agent)
  :effect (and (checked ?a) (increase (total-cost) 1)))
)

; problem
(define (problem alfred-problem)
 (:domain alfred-domain)
 (:objects
   armchairtype garbagecantype dressertype stoveburnertype desktype ottomantype bedtype - receptacletype
   penciltype pantype eggtype remotecontroltype statuetype dishspongetype platetype - objecttype
   agent1 - agent
   location1 location2 location3 location4 location5 location6 location7 location8 - location
   armchair_1 garbagecan_2 dresser_3 stoveburner_4 desk_5 ottoman_6 bed_7 dresser_8 microwave_9 fridge_10 - receptacle
   pencil_1 pan_2 egg_3 remotecontrol_4 pencil_5 statue_6 dishsponge_7 plate_8 - obj
 )
 (:init (receptacletype_0 armchair_1 armchairtype) (receptacletype_0 garbagecan_2 garbagecantype) (receptacletype_0 dresser_3 dressertype) (receptacletype_0 stoveburner_4 stoveburnertype) (receptacletype_0 desk_5 desktype) (receptacletype_0 ottoman_6 ottomantype) (receptacletype_0 bed_7 bedtype) (receptacletype_0 dresser_8 dressertype) (receptacletype_0 microwave_9 microwavetype) (receptacletype_0 fridge_10 fridgetype) (objecttype_0 pencil_1 penciltype) (objecttype_0 pan_2 pantype) (objecttype_0 egg_3 eggtype) (objecttype_0 remotecontrol_4 remotecontroltype) (objecttype_0 pencil_5 penciltype) (objecttype_0 statue_6 statuetype) (objecttype_0 dishsponge_7 dishspongetype) (objecttype_0 plate_8 platetype) (cancontain armchairtype remotecontroltype) (cancontain garbagecantype penciltype) (cancontain garbagecantype eggtype) (cancontain garbagecantype dishspongetype) (cancontain dressertype penciltype) (cancontain dressertype remotecontroltype) (cancontain dressertype statuetype) (cancontain dressertype platetype) (cancontain stoveburnertype pantype) (cancontain desktype penciltype) (cancontain desktype remotecontroltype) (cancontain desktype statuetype) (cancontain desktype platetype) (cancontain ottomantype remotecontroltype) (cancontain microwavetype eggtype) (cancontain microwavetype platetype) (cancontain fridgetype pantype) (cancontain fridgetype eggtype) (cancontain fridgetype platetype) (pickupable pencil_1) (pickupable pan_2) (isreceptacleobject pan_2) (cleanable pan_2) (coolable pan_2) (pickupable egg_3) (cleanable egg_3) (heatable egg_3) (coolable egg_3) (sliceable egg_3) (pickupable remotecontrol_4) (pickupable pencil_5) (pickupable statue_6) (pickupable dishsponge_7) (cleanable dishsponge_7) (pickupable plate_8) (isreceptacleobject plate_8) (cleanable plate_8) (heatable plate_8) (coolable plate_8) (receptacleatlocation armchair_1 location4) (receptacleatlocation garbagecan_2 location1) (receptacleatlocation dresser_3 location4) (receptacleatlocation stoveburner_4 location7) (receptacleatlocation desk_5 location5) (receptacleatlocation ottoman_6 location3) (receptacleatlocation bed_7 location7) (receptacleatlocation dresser_8 location3) (receptacleatlocation microwave_9 location2) (receptacleatlocation fridge_10 location3) (inreceptacle pencil_1 dresser_8) (inreceptacle pan_2 stoveburner_4) (inreceptacle egg_3 microwave_9) (inreceptacle remotecontrol_4 dresser_3) (inreceptacle pencil_5 desk_5) (inreceptacle statue_6 dresser_3) (inreceptacle dishsponge_7 garbagecan_2) (inreceptacle plate_8 desk_5) (objectatlocation pencil_1 location3) (objectatlocation pan_2 location7) (objectatlocation egg_3 location2) (objectatlocation remotecontrol_4 location4) (objectatlocation pencil_5 location5) (objectatlocation statue_6 location4) (objectatlocation dishsponge_7 location1) (objectatlocation plate_8 location5) (atlocation agent1 location1) (= (total-cost) 0))
 (:goal (and (exists (?r - receptacle)
 (exists (?o - obj)
 (and (heatable ?o) (objecttype_0 ?o eggtype) (receptacletype_0 ?r fridgetype) (ishot ?o) (inreceptacle ?o ?r))))))
 (:metric minimize (total-cost))
)

; plan
1. (gotolocation agent1 location1 location2)
   deleted: (atlocation agent1 location1)
   added: (atlocation agent1 location2)
   goals met: 0 of 1
2. (pickupobject agent1 location2 egg_3 microwave_9)
   deleted: (inreceptacle egg_3 microwave_9) (objectatlocation egg_3 location2)
   added: (holds agent1 egg_3) (holdsany agent1)
   goals met: 0 of 1
3. (heatobject agent1 location2 microwave_9 egg_3)
   added: (ishot egg_3)
   goals met: 0 of 1
4. (gotolocation agent1 location2 location3)
   deleted: (atlocation agent1 location2)
   added: (atlocation agent1 location3)
   goals met: 0 of 1
5. (putobject agent1 location3 egg_3 fridge_10 eggtype fridgetype)
   deleted: (holds agent1 egg_3) (holdsany agent1)
   added: (inreceptacle egg_3 fridge_10) (objectatlocation egg_3 location3)
   goals met: 1 of 1
